/**********************************************************************************
 * 파일명 : GDrag.js
 * 설 명 : Ginno Drag Class (Navigation - Move, ZoomIn, ZoomOut)
 * 필요 라이브러리 : OpenLayers
 * 
 * 수정일				수정자				version				Function 명
 * --------------------------------------------------------------------------------
 * 2011.04.19		최원석				0.1					최초 생성
 * 
 * 
 * 
 * 참고 자료
 * --------------------------------------------------------------------------------
 * OpenLayers
 * 출처 : http://openlayers.org/
 * 
 * 
**********************************************************************************/

GDrag = OpenLayers.Class(OpenLayers.Control.Navigation, {
	CLASS_NAME: "GDrag"
});