/**********************************************************************************
 * 파일명 : GLonLat.js
 * 설 명 : Ginno LonLat Class (좌표)
 * 필요 라이브러리 : OpenLayers (OpenLayers.LonLat)
 * 
 * 수정일				수정자				version				Function 명
 * --------------------------------------------------------------------------------
 * 2011.04.18		최원석				0.1					최초 생성
 * 
**********************************************************************************/
GLonLat = OpenLayers.Class(OpenLayers.LonLat, {
	CLASS_NAME: "GLonLat"
});