/**********************************************************************************
 * 파일명 : GPixel.js
 * 설 명 : Ginno Pixel Class (화면좌표)
 * 필요 라이브러리 : OpenLayers (OpenLayers.Pixel)
 * 
 * 수정일				수정자				version				Function 명
 * --------------------------------------------------------------------------------
 * 2011.04.22		최원석				0.1					최초 생성
 * 
**********************************************************************************/
GPixel = OpenLayers.Class(OpenLayers.Pixel, {
	CLASS_NAME: "GPixel"
});