/**********************************************************************************
 * 파일명 : GSize.js
 * 설 명 : Ginno Size Class (화면 영역 width, height)
 * 필요 라이브러리 : OpenLayers (OpenLayers.Size)
 * 
 * 수정일				수정자				version				Function 명
 * --------------------------------------------------------------------------------
 * 2011.04.22		최원석				0.1					최초 생성
 * 
**********************************************************************************/
GSize = OpenLayers.Class(OpenLayers.Size, {
	CLASS_NAME: "GSize"
});